{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 12,
      "content": {
        "version": "NotebookGroup/1.0",
        "groupType": "editable",
        "title": "Alert by Details",
        "expandable": true,
        "expanded": true,
        "items": [
          {
            "type": 9,
            "content": {
              "version": "KqlParameterItem/1.0",
              "parameters": [
                {
                  "id": "8387ccb5-4717-43f2-b828-ad3e8ca81a5e",
                  "version": "KqlParameterItem/1.0",
                  "name": "TimeRange",
                  "type": 4,
                  "isGlobal": true,
                  "typeSettings": {
                    "selectableValues": [
                      {
                        "durationMs": 43200000
                      },
                      {
                        "durationMs": 86400000
                      },
                      {
                        "durationMs": 172800000
                      },
                      {
                        "durationMs": 604800000
                      }
                    ],
                    "allowCustom": true
                  },
                  "timeContext": {
                    "durationMs": 86400000
                  },
                  "value": {
                    "durationMs": 604800000
                  }
                }
              ],
              "style": "formVertical",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces"
            },
            "name": "parameters - 2"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SecurityIncident\n| summarize arg_max(TimeGenerated, *) by IncidentNumber\n| extend IncidentDate = format_datetime(TimeGenerated,'dd/MM/yyyy')\n| summarize Date_Count = count() by IncidentDate",
              "size": 0,
              "aggregation": 3,
              "title": "Day Wise Alert Count",
              "timeContextFromParameter": "TimeRange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "visualization": "barchart"
            },
            "customWidth": "50",
            "name": "Day Wise Alert Count"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SecurityIncident\n| summarize arg_max(TimeGenerated, *) by IncidentNumber\n| where Classification contains \"undetermined\"\n| extend IncidentDate = format_datetime(TimeGenerated,'dd/MM/yyyy')\n| summarize Date_Count = count() by IncidentDate",
              "size": 0,
              "aggregation": 1,
              "title": "Undetermined Alerts (Closed by Sentinel)",
              "timeContextFromParameter": "TimeRange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "visualization": "barchart"
            },
            "customWidth": "50",
            "name": "query - 2"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SecurityIncident\n| summarize arg_max(TimeGenerated, *) by IncidentNumber\n| where Title !contains \"DLP\"\n| where Classification contains \"undetermined\"\n| summarize Count =  count() by Title\n| top 10 by Count desc ",
              "size": 0,
              "title": "Top 10 Undetermined Alerts",
              "timeContextFromParameter": "TimeRange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "sortBy": []
            },
            "customWidth": "30",
            "name": "query - 3",
            "styleSettings": {
              "margin": "25",
              "padding": "25"
            }
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SecurityIncident\n| summarize arg_max(TimeGenerated, *) by IncidentNumber\n| where Title !has \"DLP\" or Title !has \"Exfiltration\"\n| where Classification !contains \"undetermined\"\n| extend IncidentDate = format_datetime(TimeGenerated,'dd/MM/yyyy')\n| summarize Date_Count = count() by IncidentDate",
              "size": 0,
              "title": "Day Wise Incident Count",
              "timeContextFromParameter": "TimeRange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "sortBy": []
            },
            "customWidth": "30",
            "name": "query - 5"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SecurityIncident\r\n| summarize arg_max(TimeGenerated, *) by IncidentNumber\r\n| where Title contains \"PDPA\"\r\n| where Classification contains \"undetermined\"\r\n| summarize count(), make_set(Title)",
              "size": 0,
              "title": "DLP (PDPA) Alert Count - undetermined",
              "timeContextFromParameter": "TimeRange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "visualization": "stat",
              "tileSettings": {
                "showBorder": false
              },
              "graphSettings": {
                "type": 0
              },
              "mapSettings": {
                "locInfo": "LatLong",
                "sizeSettings": "count_",
                "sizeAggregation": "Sum",
                "legendMetric": "count_",
                "legendAggregation": "Sum",
                "itemColorSettings": {
                  "type": "heatmap",
                  "colorAggregation": "Sum",
                  "nodeColorField": "count_",
                  "heatmapPalette": "greenRed"
                }
              }
            },
            "customWidth": "20",
            "name": "query - 9",
            "styleSettings": {
              "margin": "25",
              "padding": "25"
            }
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SecurityIncident\n| summarize arg_max(TimeGenerated, *) by IncidentNumber\n| where Title contains \"DLP policy (General Data Protection Regulation (GDPR)\"\n| where Classification contains \"undetermined\"\n| summarize count(), make_set(Title)\n\n",
              "size": 0,
              "title": "DLP (GDPR) Alert Count - undetermined",
              "timeContextFromParameter": "TimeRange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "visualization": "stat"
            },
            "customWidth": "20",
            "name": "query - 4"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SecurityIncident\n| summarize arg_max(TimeGenerated, *) by IncidentNumber\n| where Title contains \"DLP\" or Title contains \"Exfiltration\"\n| extend IncidentDate = format_datetime(TimeGenerated,'dd/MM/yyyy')\n| summarize Date_Count = count() by IncidentDate",
              "size": 0,
              "title": "DLP DATA - Total",
              "timeContextFromParameter": "TimeRange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "sortBy": []
            },
            "customWidth": "25",
            "name": "query - 6"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SecurityIncident\n| summarize arg_max(TimeGenerated, *) by IncidentNumber\n| where Title contains \"DLP\" or Title contains \"Exfiltration\"\n| where Status contains \"Closed\" \n| extend IncidentDate = format_datetime(TimeGenerated,'dd/MM/yyyy')\n| summarize Date_Count = count() by IncidentDate",
              "size": 0,
              "title": "DLP DATA - Closed",
              "timeContextFromParameter": "TimeRange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "gridSettings": {
                "sortBy": [
                  {
                    "itemKey": "IncidentDate",
                    "sortOrder": 2
                  }
                ]
              },
              "sortBy": [
                {
                  "itemKey": "IncidentDate",
                  "sortOrder": 2
                }
              ]
            },
            "customWidth": "25",
            "name": "query - 6 - Copy"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SecurityIncident\n| extend IncidentDate = format_datetime(TimeGenerated,'dd/MM/yyyy')\n| summarize arg_max(IncidentDate, *) by IncidentNumber\n| where AdditionalData !contains \"Microsoft Data Loss Prevention\"\n| where Classification !contains \"undetermined\"\n//| summarize Date_Count = count() by IncidentDate\n| summarize count() by Severity, bin(TimeGenerated, 1d)",
              "size": 0,
              "title": "Day-Wise Severity Classification",
              "timeContextFromParameter": "TimeRange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "visualization": "unstackedbar"
            },
            "customWidth": "50",
            "name": "query - 7"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "SecurityIncident\n| extend IncidentDate = format_datetime(TimeGenerated,'dd/MM/yyyy')\n| summarize arg_max(IncidentDate, *) by IncidentNumber\n| where Classification in (\"Undetermined\",\"BenignPositive\",\"TruePositive\")\n| summarize count() by Classification",
              "size": 2,
              "title": "Incident Handling - Key Criteria",
              "timeContextFromParameter": "TimeRange",
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "visualization": "piechart",
              "chartSettings": {
                "yAxis": [
                  "count_"
                ],
                "showLegend": true,
                "ySettings": {
                  "numberFormatSettings": {
                    "unit": 1,
                    "options": {
                      "style": "decimal",
                      "useGrouping": true,
                      "minimumIntegerDigits": 1,
                      "minimumFractionDigits": 1,
                      "maximumFractionDigits": 1,
                      "minimumSignificantDigits": 1,
                      "maximumSignificantDigits": 1
                    },
                    "missingSparkDataOption": "Max"
                  }
                }
              }
            },
            "customWidth": "30",
            "name": "query - 8"
          }
        ]
      },
      "name": "Alert by Details",
      "styleSettings": {
        "showBorder": true
      }
    }
  ],
  "fallbackResourceIds": [
    "/subscriptions/2eafe57e-6f45-4251-a4e8-6ca7d6a844cc/resourcegroups/rg-monitor-core-001/providers/microsoft.operationalinsights/workspaces/law-monitor-core-001"
  ],
  "fromTemplateId": "sentinel-UserWorkbook",
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}
